# -*- coding: utf-8 -*-

CLAUDE_URL = "https://platform.claude.com/settings/keys"
CHATGPT_URL = "https://platform.openai.com/account/api-keys"
GEMINI_URL = "https://aistudio.google.com/app/api-keys"

FORWARD_TEXT = "Надішли розробнику: @BogdanovychBot"

START_TEXT = (
    "🤖 Привіт! Мене звати Nexus Shell | AI Agent\n\n"
    "Ти підключився до універсальної оболонки для роботи з провідними мовними моделями. "
    "Тепер Gemini, GPT та Claude доступні в одному інтерфейсі твого Telegram.\n\n"
    "Щоб розпочати роботу, виконай три прості кроки:\n\n"
    "1️⃣ 🔑 Підключи API-ключ\n"
    "Скористайся командою `/setup`, щоб додати свій ключ від потрібної моделі. "
    "Я підтримую пряму інтеграцію, що забезпечує швидкість та конфіденційність.\n\n"
    "2️⃣ 🧠 Встанови Генеральний промпт\n"
    "Задай контекст, роль або правила поведінки свого агента. Це дозволить боту "
    "стати асистентом, аналітиком або розробником.\n\n"
    "3️⃣ 🚀 Починай роботу\n"
    "Надсилай звичайні промпти, і твій кастомний агент миттєво візьметься до виконання завдань.\n\n"
    "--- \n"
    "Використовуй /help, щоб дізнатися, як отримати API-ключ."
)

HELP_TEXT = (
    "🔑 Де отримати API-ключі для Nexus Shell?\n\n"
    "Для роботи бота тобі необхідно згенерувати ключі на офіційних платформах розробників:\n\n"
    "🔹 Gemini (Google):\n"
    f"{GEMINI_URL}\n\n"
    "🔹 Claude (Anthropic):\n"
    f"{CLAUDE_URL}\n\n"
    "🔹 ChatGPT (OpenAI):\n"
    f"{CHATGPT_URL}\n\n"
    "--- \n"
    "⚠️ Важливо:\n"
    "• Ключі використовуються виключно для запитів до моделей.\n"
    "• Переконайся, що на балансі (Google/Anthropic/OpenAI) є кошти для оплати запитів через API.\n\n"
)
